Revit 2026 API

# AppearanceAssetElementGetAppearanceAssetElementByName Method

---

Gets an AppearanceAssetElement by name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AppearanceAssetElement GetAppearanceAssetElementByName(
	Document doc,
	string name
)
```
```vb
Public Shared Function GetAppearanceAssetElementByName (
	doc As Document,
	name As String
) As AppearanceAssetElement
```
```cpp
public:
static AppearanceAssetElement^ GetAppearanceAssetElementByName(
	Document^ doc,
	String^ name
)
```
```fsharp
static member GetAppearanceAssetElementByName :
        doc : Document *
        name : string -> AppearanceAssetElement
```

#### Parameters

doc Document
     Document containing the AppearanceAssetElement.
name String
     Name of the AppearanceAssetElement.

#### Return Value

AppearanceAssetElement The AppearanceAssetElement with the given name, or  if this element does not exist.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AppearanceAssetElement Class

Autodesk.Revit.DB Namespace